from string import Template 

### RAG PROMPTS ###

### System ###
system_prompt = "\n".join([
    "أنت مساعد لتوليد رد للمستخدم.",
    "سيتم تزويدك بمجموعة من الوثائق المرتبطة باستفسار المستخدم.",
    "يجب أن تولد الرد بناءً على الوثائق المقدمة.",
    "تجاهل الوثائق التي لا ترتبط باستفسار المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من توليد رد.",
    "يجب أن يكون الرد بنفس لغة استفسار المستخدم.",
    "كن مهذباً ومحترماً في ردودك.",
    "كن دقيقاً ومختصراً في ردك، وتجنب المعلومات غير الضرورية.",
])

### Document ###
document_prompt = Template(
    "\n".join([
        "## الوثيقة رقم: $doc_num",
        "### المحتوى: $chunk_text",
    ])
)

### Footer ###
footer_prompt = Template(
    "\n".join([
        "استناداً فقط إلى الوثائق أعلاه، يرجى توليد إجابة للمستخدم.",
        "## الإجابة: ",
    ])
)
